import "@/utils/stringExtensions";
import { COMMON_TEXTS } from "../shared/(texts)/app-texts";
import { capitalize } from "@/utils/stringExtensions";

export const HOME_TEXTS = {
  HERO_SECTION: {
    TITLE_1: "Ласкаво просимо до",
    TITLE_2: "Ваш розумний трекер калорій і макроелементів",
    DESCRIPTION:
      "Візьміть контроль над своїм харчуванням за допомогою ШІ. NomTrack — це сучасний інструмент, створений, щоб зробити здорове харчування легким, персоналізованим і приємним.",
    EXAMPLE_TITLE: "Підсумок за сьогодні",
    DATE: "15 червня",
    UNIT_KILOCALORIE: COMMON_TEXTS.UNIT_KILOCALORIE,
    UNIT_GRAM: COMMON_TEXTS.UNIT_GRAM,
    PROTEIN: COMMON_TEXTS.PROTEIN,
    FAT: COMMON_TEXTS.FAT,
    CARBOHYDRATE: COMMON_TEXTS.CARBOHYDRATE,
    BREAKFAST: COMMON_TEXTS.BREAKFAST,
    BREAKFAST_DESCRIPTION: "Грецький йогурт з ягодами",
    LUNCH: COMMON_TEXTS.LUNCH,
    LUNCH_DESCRIPTION: "Курячий салат",
  },
  CTA_SECTION: {
    TITLE: "Готовий до справжніх змін? Я теж.",
    DESCRIPTION:
      "NomTrack — це результат боротьби між бажанням схуднути і любов’ю до автоматизації. Я хотів трекати харчування, але створив систему, яка трекає мене. Кожен апдейт — не просто нова функція, а ще один крок до легшого, розумнішого і більш збалансованого “я”.",
    BUTTON: "Спробувати безкоштовний період",
  },
  FEATURE_SECTION: {
    TITLE: "✨ Наші можливості",
    DESCRIPTION:
      "NomTrack поєднує в собі потужний трекінг і ШІ-помічника, щоб допомогти вам досягти ваших цілей у харчуванні.",
    FEATURES_DATA: [
      {
        title: "Відстежуйте калорії та макроси",
        description:
          "Автоматично реєструйте та аналізуйте щоденне споживання білків, жирів і вуглеводів.",
      },
      {
        title: "Підбір страв на основі ШІ",
        description:
          "Дозвольте нашому розумному помічнику генерувати страви на основі ваших цілей, дієтичних уподобань і доступних інгредієнтів",
      },
      {
        title: "Візуалізуйте свій прогрес",
        description:
          "Наочні графіки показують, як змінюється ваш раціон і де потрібно внести корективи.",
      },
      {
        title: "Встановлюйте цілі та зберігайте мотивацію",
        description:
          "Незалежно від того, чи хочете ви схуднути, набрати м'язову масу, чи просто харчуватися здоровіше, NomTrack допоможе вам не збитися зі шляху.",
      },
      {
        title: "База даних більше ніж 160'000 продуктів",
        description: "Записуйте свої страви за лічені секунди.",
      },
      {
        title: "Синхронізація між пристроями",
        description:
          "Ваші дані завжди з вами — на мобільному, планшеті чи комп'ютері.",
      },
    ],
  },
  PHILOSOPHY_SECTION: {
    TITLE: "🧠 Усвідомленість, а не обмеження",
    DESCRIPTION:
      "Відстеження харчування має надавати сили, а не бути обтяжливим. NomTrack побудований на принципах мінімалістичного дизайну та ключових засадах дієтології, щоб внести ясність і усвідомленість у ваші харчові звички та допомогти вам побудувати здоровіші стосунки з їжею.",

    CARD_DATA: [
      {
        title: capitalize(COMMON_TEXTS.CALORIES),
        description:
          "Енергія, що живить ваш день. Nomtrack допоможе знайти правильний баланс для досягнення ваших цілей.",
      },
      {
        title: capitalize(COMMON_TEXTS.PROTEIN),
        description:
          "Основні будівельні блоки для м'язів і тканин. Важливі для відновлення, сили та відчуття ситості.",
      },
      {
        title: capitalize(COMMON_TEXTS.CARBOHYDRATE),
        description:
          "Головне джерело енергії для вашого тіла. Обирайте складні вуглеводи для стабільної, чистої енергії протягом дня.",
      },
      {
        title: capitalize(COMMON_TEXTS.FAT),
        description:
          "Життєво важливі для вироблення гормонів, здоров'я мозку та засвоєння вітамінів. Здорові жири — ваші друзі.",
      },
    ],
  },
  PRICING_SECTION: {
    TITLE: "Один план. Усі можливості.",
    DESCRIPTION:
      "Спробуйте всі функції NomTrack. Скасуйте підписку в будь-який час.",
    FIRST_CLIENTS_OFFER: "Пропозиція для перших клієнтів",
    NAME: COMMON_TEXTS.NOMTRACK,
    ABOUT:
      "Повний набір інструментів для досягнення ваших цілей у харчуванні та оздоровленні.",
    MONTH: COMMON_TEXTS.MONTH,
    FIXED_PRICE: "Ціна зафіксована назавжди для перших 200 користувачів.",
    ITEMS: [
      "500 токенів для запитів",
      "Персональний ШІ-коуч для інсайтів і порад",
      "Розширені звіти про прогрес та аналітика",
      "Аналіз рецептів та персональна база даних",
      "Відстеження споживання води та активності",
      "Досвід без жодної реклами",
    ],
    CTA: "Почати 7-денний безкоштовний пробний період",
    TRIAL_PERIOD:
      "Перші 7 днів безкоштовно, після чого застосовується спеціальна ціна.",
  },
};
